In [54]:
import pandas as pd

In [55]:
# Importez les trois datasets
superficie = pd.read_csv("superficie.csv")
nb_de_sdb = pd.read_csv("nombre_de_sdb.csv")
nb_de_chambre = pd.read_csv("nombre_de_chambres.csv")

In [56]:
nb_de_chambre.head(3)

   0  1
0  1  4
1  2  1
2  3  4

In [57]:
# Donnez un nom de colonne à ces trois datasets
superficie.columns = ["id", "superficie"]
nb_de_sdb.columns = ["id", "nb_de_sdb"]
nb_de_chambre.columns = ["id", "nb_de_chambre"]

In [6]:
"""
autre solution :
nb_de_chambre.columns.values[0] = "id"
nb_de_chambre.columns.values[1] = "nb_de_chambre"
"""

'\nautre solution :\nnb_de_chambre.columns.values[0] = "id"\nnb_de_chambre.columns.values[1] = "nb_de_chambre"\n'

In [58]:
#Fusionner ces trois datasets un seul dataframe (on fera une fusion simplement par index) qu’on nommera dataset
#étape intermédiare
dataset_temp = pd.merge(superficie, nb_de_sdb, left_on = "id", right_on = "id", how="inner")

In [59]:
#DONE
dataset = pd.merge(dataset_temp, nb_de_chambre, left_on = "id", right_on = "id", how = "inner")

In [60]:
dataset.head(5)

   id  superficie  nb_de_sdb  nb_de_chambre
0   1       27667          1              4
1   2       14742          1              1
2   3       28089          3              4
3   4       11713          1              2
4   5       28591          3              4

In [61]:
# Quelle est la superficie moyenne des maisons de notre dataset
round(dataset["superficie"].mean(), 2)

20354.88

In [62]:
# Quelle est le nombre de chambre médian et moyenne
print("moyenne: {}".format(round(dataset["nb_de_chambre"].mean(),2)))
print("médiane: {}".format(dataset["nb_de_chambre"].median()))

moyenne: 2.43
médiane: 2.0

In [63]:
#Nous un nouveau dataset “house_price.csv” que nous voudrions intégrer à notre dataset
#Importez house_price.csv dans une variable qu’on nommera house_price
house_price = pd.read_csv("house_price.csv")

In [64]:
house_price.sort_values(by="id", ascending=True).head(3)

    Unnamed: 0  id  house_price
32          32   0    1421908.0
71          71   1    1305091.0
65          65   2     164373.0

In [65]:
# iii) Fusionnez house_price à dataset
dataset = pd.merge(dataset, house_price, left_on = "id", right_on = "id", how = "inner")

In [66]:
dataset.head(5)

   id  superficie  nb_de_sdb  nb_de_chambre  Unnamed: 0  house_price
0   1       27667          1              4          71    1305091.0
1   2       14742          1              1          65     164373.0
2   3       28089          3              4          88    1441714.0
3   4       11713          1              2          49     108290.0
4   5       28591          3              4          33    1703033.0

In [67]:
#Quel est le coût moyen d’une maison ?
round(dataset["house_price"].mean(), 2)

761140.19

In [68]:
# Quel est le coût moyen par chambre
dataset.loc[:,["nb_de_chambre", "house_price"]].groupby(["nb_de_chambre"]).mean()

                 house_price
nb_de_chambre
1              960723.363636
2              642086.258065
3              645904.592593
4              888045.631579

In [69]:
#Tentons de faire des catégories de superficie
# i) Créez une nouvelle colonne dans votre dataset qu’on appellera taille_maison
dataset["taille_maison"] = None

In [70]:
dataset.head(3)

,id,superficie,nb_de_sdb,nb_de_chambre,Unnamed: 0,house_price,taille_maison
0,1,27667,1,4,71,1305091.0,None
1,2,14742,1,1,65,164373.0,None
2,3,28089,3,4,88,1441714.0,None

In [73]:
# dataset.where(dataset["superficie"] > 25000) #.fillna(value = "Très grande")
dataset2 = dataset[dataset["superficie"] > 25000].fillna(value = "Très grande")

In [75]:
dataset2.head(3)

,id,superficie,nb_de_sdb,nb_de_chambre,Unnamed: 0,house_price,taille_maison
0,1,27667,1,4,71,1305091.0,Très grande
2,3,28089,3,4,88,1441714.0,Très grande
4,5,28591,3,4,33,1703033.0,Très grande